[
    {
        "goal": "EXTENSIBILITY",
        "description": "Extensibility is an ability to add or extend additional elements and features to the existing solution."
    },
    {
        "goal": "ACCESSIBILITY",
        "description": "The ability for authorized users to easily access and use the solution from anywhere."
    },
    {
        "goal": "MAINTAINABILITY",
        "description": "The ability to easily manage and update the solution."
    },
    {
        "goal": "SECURITY",
        "description": "To secure the solution and data is only available to those who have appropriate access."
    },
    {
        "goal": "RELIABILITY",
        "description": "The solution works consistently and can be counted on from a business perspective and performs as expected."
    },
    {
        "goal": "PERFORMANT",
        "description": "The solution performs quickly enough to meet the business demand."
    },
    {
        "goal": "INTELLIGENT",
        "description": "The solution learns or provides new insights."
    },
    {
        "goal": "CONSISTENCY",
        "description": "Consistency means having solution work reliably and in the same manner every time."
    },
    {
        "goal": "SELF-DOCUMENTING",
        "description": "The solution should be able to produce its own documentation."
    },
    {
        "goal": "SELF-TESTING",
        "description": "Each component of the solution should be able to perform its own unit test."
    },
    {
        "goal": "TALKING",
        "description": "The solution should be smart enough to explain itself to a non-technical human."
    },
    {
        "goal": "SIMPLE",
        "description": "The solution should be lean and choose the simplest method of achievement."
    },
    {
        "goal": "PYTHONIC",
        "description": "If the solution is built in python it is built using the python way."
    },
    {
        "goal": "NO CODE-LOW CODE",
        "description": "The solution should contain the minimal code or no code required to achieve objective."
    }
]